# Lbf Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
SymbolTypeId..::..Lbf Property
SymbolTypeId Class See Also
---
Symbol lbf, indicating unit Pounds force.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2021
# Syntax
C#
---
```text
public static ForgeTypeId Lbf { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property Lbf As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ Lbf {
	ForgeTypeId^ get ();
}
```

# See Also
SymbolTypeId Class
Autodesk.Revit.DB Namespace